app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC
---
  def index
    tasks = Task.order(created_at: :desc)

INSERT INTO "tasks" ("description", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["description", "New task description"], ["created_at", "2025-12-05 07:41:22.544784"], ["updated_at", "2025-12-05 07:41:22.544784"]]
---
    task = Task.new(task_params)

    if task.save